In [45]:
import pandas as pd
import numpy as np

data = {'Animal': ['Dog',  'Orangutan', 'Eagle','Pandas', "Elephant"], 
        'Name': ['Ellen',  'Adam',  'Joe', 'Eve','Eve'], 
        'Legs': [4, 2, 1, 3,4],
        'IsNice': [1,0,0,0,1]}
df = pd.DataFrame(data, columns=['Animal', 'Name', 'Legs', "IsNice"])

In [2]:
df

      Animal   Name  Legs  IsNice
0        Dog  Ellen     4       1
1  Orangutan   Adam     2       0
2      Eagle    Joe     1       0
3     Pandas    Eve     3       0
4   Elephant    Eve     4       1

In [3]:
from pandas.io.json import json_normalize
dfx = [{'id': 1, 'name': {'first': 'Anna', 'last': 'Rich'}},
         {'name': {'given': 'Anna', 'family': 'Broke'}},
         {'id': 2, 'name': {'first': 'Anna', 'last': 'Here'}}]
json_normalize(dfx)

    id name.family name.first name.given name.last
0  1.0         NaN       Anna        NaN      Rich
1  NaN       Broke        NaN       Anna       NaN
2  2.0         NaN       Anna        NaN      Here

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
Animal    5 non-null object
Name      5 non-null object
Legs      5 non-null int64
IsNice    5 non-null int64
dtypes: int64(2), object(2)
memory usage: 240.0+ bytes

In [5]:
df.shape

(5, 4)

In [8]:
df.columns

Index(['Animal', 'Name', 'Legs', 'IsNice'], dtype='object')

In [9]:
df.head

<bound method NDFrame.head of       Animal   Name  Legs  IsNice
0        Dog  Ellen     4       1
1  Orangutan   Adam     2       0
2      Eagle    Joe     1       0
3     Pandas    Eve     3       0
4   Elephant    Eve     4       1>

In [10]:
sorted = df.sort_values(by=['Legs'], ascending=False)

In [11]:
sorted

      Animal   Name  Legs  IsNice
0        Dog  Ellen     4       1
4   Elephant    Eve     4       1
3     Pandas    Eve     3       0
1  Orangutan   Adam     2       0
2      Eagle    Joe     1       0

In [12]:
df[1:]

      Animal  Name  Legs  IsNice
1  Orangutan  Adam     2       0
2      Eagle   Joe     1       0
3     Pandas   Eve     3       0
4   Elephant   Eve     4       1

In [13]:
df[:3]

      Animal   Name  Legs  IsNice
0        Dog  Ellen     4       1
1  Orangutan   Adam     2       0
2      Eagle    Joe     1       0

In [15]:
df['Name']

0    Ellen
1     Adam
2      Joe
3      Eve
4      Eve
Name: Name, dtype: object

In [16]:
df.loc[2]

Animal    Eagle
Name        Joe
Legs          1
IsNice        0
Name: 2, dtype: object

In [17]:
df

      Animal   Name  Legs  IsNice
0        Dog  Ellen     4       1
1  Orangutan   Adam     2       0
2      Eagle    Joe     1       0
3     Pandas    Eve     3       0
4   Elephant    Eve     4       1

In [18]:
df.iloc[[0],[0]]

  Animal
0    Dog

In [19]:
df.iloc[[0, 2, 3]]

   Animal   Name  Legs  IsNice
0     Dog  Ellen     4       1
2   Eagle    Joe     1       0
3  Pandas    Eve     3       0

In [20]:
df.loc[[0], ['Name']]

    Name
0  Ellen

In [22]:
df.loc[[0]]

  Animal   Name  Legs  IsNice
0    Dog  Ellen     4       1

In [24]:
 df.loc[[0], ['Name']]

    Name
0  Ellen

In [29]:
df[df['Legs'] > 2]

     Animal   Name  Legs  IsNice
0       Dog  Ellen     4       1
3    Pandas    Eve     3       0
4  Elephant    Eve     4       1

In [30]:
df[(df['Legs'] > 2) & (df['Name'] == 'Eve')][['Animal', 'Legs']]

     Animal  Legs
3    Pandas     3
4  Elephant     4

In [31]:
df[df['Legs'].isin([4,2])]

      Animal   Name  Legs  IsNice
0        Dog  Ellen     4       1
1  Orangutan   Adam     2       0
4   Elephant    Eve     4       1

In [32]:
 df[(df['Name'] == 'Eve') | (df['Name'] == 'Allen')][['Legs']]

   Legs
3     3
4     4

In [33]:
df['Legs'].sum()

14

In [34]:
df['Legs'].mean()

2.8

In [35]:
df[df['Legs'] > 2].sum()['Legs']

11

In [36]:
df['Flock'] = df['Legs']*12

In [37]:
df

      Animal   Name  Legs  IsNice  Flock
0        Dog  Ellen     4       1     48
1  Orangutan   Adam     2       0     24
2      Eagle    Joe     1       0     12
3     Pandas    Eve     3       0     36
4   Elephant    Eve     4       1     48

In [46]:
color = ['red','blue','brown','blue','orange']
df['Color'] = pd.Series(color)
df

      Animal   Name  Legs  IsNice   Color
0        Dog  Ellen     4       1     red
1  Orangutan   Adam     2       0    blue
2      Eagle    Joe     1       0   brown
3     Pandas    Eve     3       0    blue
4   Elephant    Eve     4       1  orange

In [47]:
df = df.drop(['Name'], axis=1)
df

      Animal  Legs  IsNice   Color
0        Dog     4       1     red
1  Orangutan     2       0    blue
2      Eagle     1       0   brown
3     Pandas     3       0    blue
4   Elephant     4       1  orange

In [48]:
def yes_no_recode(value):
    recoded = np.where(value == 1,'Yes','No')
    return recoded
    
df["IsNiceRecoded"] = df["IsNice"].apply(yes_no_recode)
df

      Animal  Legs  IsNice   Color IsNiceRecoded
0        Dog     4       1     red           Yes
1  Orangutan     2       0    blue            No
2      Eagle     1       0   brown            No
3     Pandas     3       0    blue            No
4   Elephant     4       1  orange           Yes